ATsupportum/src/InformationRegisters/ПодпискиПолучателей/ПодпискиПолучателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиПолучателей</name>
  <dimensions>
    <name>КаналСообщений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.ОбменСообщениями</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/ПодпискиПолучателей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Определяет конечные точки (подписчиков) для широковещательного канала
// типа "Публикация/Подписка".
//
// Параметры:
//  КаналСообщений – Строка. Идентификатор широковещательного канала сообщений.
//
// Возвращаемое значение:
//  Тип: Массив. Массив элементов конечных точек.
//  Массив содержит элементы типа ПланОбменаСсылка.ОбменСообщениями.
//
Функция ПодписчикиКаналаСообщений(Знач КаналСообщений) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПодпискиПолучателей.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.ПодпискиПолучателей КАК ПодпискиПолучателей
	|ГДЕ
	|	ПодпискиПолучателей.КаналСообщений = &КаналСообщений";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КаналСообщений", КаналСообщений);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
КонецФункции

#КонецЕсли
